Revit 2027 API
AdvancedGlazing.SurfaceNormal Property
 The property labeled "Image" from the "AdvancedGlazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SurfaceNormal { get; }
Public Shared ReadOnly Property SurfaceNormal As String
	Get
public:
static property String^ SurfaceNormal {
	String^ get ();
}
static member SurfaceNormal : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
AdvancedGlazing Class
Autodesk.Revit.DB.Visual Namespace